src/Reports/ДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ДвижениеДенежныхСредств</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/ДвижениеДенежныхСредств/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик нажатия на кнопку "Сформировать".
//
Процедура СформироватьВыполнить()
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
// Процедура выводит движения по регистру бухгалтерии.
//
Процедура СформироватьОтчет()
	
	СтруктурныеЕдиницы.Очистить();
	ТабличныйДокументОтчет.Очистить();
	СписокГруппировки.Очистить();
	
	ВысотаОтчета = 0;
	Первый = Истина;

	ВсегоНачОст = 0;
	ВсегоКонОст = 0;
	ВсегоТД = 0;
	ВсегоФД = 0;
	Процент = 0;
		
	///////////////////// Отбор по стр. ед. ////////////////////
	
	Если ЭтаФорма.СтруктурныеЕдиницыИспользование И ЭтаФорма.СтруктурныеЕдиницыОтбор.Количество() > 0 Тогда
		
		ЗапросСтрЕд = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                           |	СтруктурныеЕдиницы.Ссылка КАК СтрЕд
		                           |ИЗ
		                           |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		                           |ГДЕ
		                           |	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		                           |	И СтруктурныеЕдиницы.Ссылка В(&Ссылка)
		                           |
		                           |УПОРЯДОЧИТЬ ПО
		                           |	СтруктурныеЕдиницы.Наименование");
								   
		ЗапросСтрЕд.УстановитьПараметр("Ссылка",ЭтаФорма.СтруктурныеЕдиницыОтбор);
		СтруктурныеЕдиницы.Загрузить(ЗапросСтрЕд.Выполнить().Выгрузить());

		
		//Для Каждого СтрЕдОтбор Из ЭтаФорма.СтруктурныеЕдиницыОтбор Цикл
		//	
		//	НС = СтруктурныеЕдиницы.Добавить();
		//	НС.СтрЕд = СтрЕдОтбор.Значение;
		//	
		//КонецЦикла;
		
		НС = СтруктурныеЕдиницы.Вставить(0); 
		НС.СтрЕд = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		
	Иначе
		
		ЗапросСтрЕд = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктурныеЕдиницы.Ссылка КАК СтрЕд
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтруктурныеЕдиницы.Наименование");
		
		СтруктурныеЕдиницы.Загрузить(ЗапросСтрЕд.Выполнить().Выгрузить());
		НС = СтруктурныеЕдиницы.Вставить(0);
		НС.СтрЕд = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		
	КонецЕсли;	
	
	//////////////////// Отбор по Кассам (влияет на стр.ед.) /////////////////
	
	Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда 
		
		ЗапросСтрЕдПоКасса = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросСтрЕд.СтруктурнаяЕдиница КАК СтрЕд 
		|ИЗ
		|	(ВЫБРАТЬ
		|		Кассы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|	ИЗ
		|		Справочник.Кассы КАК Кассы
		|	ГДЕ
		|		Кассы.Ссылка В(&СчетКассаОтбор)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтруктурныеЕдиницы.Ссылка
		|	ИЗ
		|		Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|	ГДЕ
		|		СтруктурныеЕдиницы.Организация В
		|				(ВЫБРАТЬ
		|					БанковскиеСчета.Владелец
		|				ИЗ
		|					Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ГДЕ
		|					БанковскиеСчета.Ссылка В (&СчетКассаОтбор))) КАК ЗапросСтрЕд
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросСтрЕд.СтруктурнаяЕдиница.Наименование");
		
		ЗапросСтрЕдПоКасса.УстановитьПараметр("СчетКассаОтбор", СчетКассаОтбор);
		
		СтруктурныеЕдиницы.Очистить();
		СтруктурныеЕдиницы.Загрузить(ЗапросСтрЕдПоКасса.Выполнить().Выгрузить());
		НС = СтруктурныеЕдиницы.Вставить(0);
		НС.СтрЕд = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
	КонецЕсли;
	
	
	/////////////// ОСНОВНОЙ ЦИКЛ ПО СТР.ЕД. ////////////////////////////////////////////////
	
	Для Каждого СтрокаСтрЕд ИЗ СтруктурныеЕдиницы Цикл
		
		ТабличныйДокумент.Очистить();	
		ИтогДС = 0;
		ИтогП = 0;
		ИтогР = 0;
		КонтрольнаяЦифра = 0;
		СтруктурнаяЕдиница = СтрокаСтрЕд.СтрЕд;
		
		Макет 				= Отчеты.ДвижениеДенежныхСредств.ПолучитьМакет("Макет");
		ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьОстаток 		= Макет.ПолучитьОбласть("Остаток");
		ОбластьРаздел 		= Макет.ПолучитьОбласть("Раздел");
		ОбластьИтогРаздел 	= Макет.ПолучитьОбласть("ИтогРаздел");
		
		Если ЭтаФорма.ПериодИспользование Тогда
			ОбластьЗаголовок.Параметры.Период = ЭтаФорма.Период;
		Иначе
			ОбластьЗаголовок.Параметры.Период = "";
		КонецЕсли;
	
		ОбластьЗаголовок.Параметры.ТекСтрЕд = ?(СтруктурнаяЕдиница.Пустая(), "ВСЕГО", СтруктурнаяЕдиница);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// ОСТАТКИ -----------------------------------------------------------------------------------------------
		
		ЗапросОстатки = Новый Запрос;
		ЗапросОстатки.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УправленческийОстаткиИОбороты.СуммаНачальныйОстатокДт,
		|	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
		|			,
		|			"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","") 
		+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")
		+ ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"Субконто1 В (&СчетКасса)","")+") КАК УправленческийОстаткиИОбороты";
		//+ ?(ЗначениеЗаполнено(СчетКасса),"Субконто1 = &СчетКасса","")+") КАК УправленческийОстаткиИОбороты";
				
		
		Если ЭтаФорма.ПериодИспользование Тогда
			
			ЗапросОстатки.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
			Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
				ЗапросОстатки.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));		
			Иначе	
				ЗапросОстатки.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
			КонецЕсли;	
			
		Иначе
			ЗапросОстатки.УстановитьПараметр("НачалоПериода", '00010101');	
			ЗапросОстатки.УстановитьПараметр("КонецПериода", '00010101');	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			ЗапросОстатки.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
		КонецЕсли;		
		
		Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда
			ЗапросОстатки.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
		КонецЕсли;	
		
		РезультатОстатки = ЗапросОстатки.Выполнить().Выбрать();
		ЕстьОстатки = РезультатОстатки.Следующий();
		ОбластьОстаток.Параметры.СтрокаОстаток = "ОСТАТОК НА НАЧАЛО";
		Если ЕстьОстатки Тогда
			ОбластьОстаток.Параметры.Остаток = РезультатОстатки.СуммаНачальныйОстатокДт;
			КонтрольнаяЦифра = КонтрольнаяЦифра + РезультатОстатки.СуммаНачальныйОстатокДт; 	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Процент = ?(ВсегоНачОст = 0, 0, Окр(ОбластьОстаток.Параметры.Остаток/ВсегоНачОст * 100,2));
		Иначе
			ВсегоНачОст = ОбластьОстаток.Параметры.Остаток;	
		КонецЕсли;	
		
		ОбластьОстаток.Параметры.Процент = ?(Процент = 0, "", Строка(Процент) +" %");
		
		ТабличныйДокумент.Вывести(ОбластьОстаток);	
		
		
		// ------------------------------------------------- ПРИХОД ТД -------------------------------------------
		
		ОбластьШапка.Параметры.Раздел = "ТЕКУЩАЯ ДЕЯТЕЛЬНОСТЬ";
		ТабличныйДокумент.Вывести(ОбластьШапка);	
		ОбластьРаздел.Параметры.СтрокаРаздел = "Приход";
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		// Оплаты от покупателей авансом -------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам)", "Оплаты от покупателей авансом");
		
		// Оплаты от покупателей ---------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Эквайринг)", "Оплаты от покупателей");
		
		// Возвраты от поставщиков  ------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики)", "Возвраты от поставщиков");
		
		// Возвраты от подотчетников -----------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет)", "Возвраты от подотчетников");
		
		// Возвраты зарплаты -------------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Зарплата)", "Возвраты зарплаты");
		
		// Прочие доходы -----------------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный)", "Прочие доходы");      
		
		
		// ------------------------------------------------- РАСХОД ТД -------------------------------------------
		
		ОбластьРаздел.Параметры.СтрокаРаздел = "Расход";
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		// Оплаты поставщикам ------------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Оплаты поставщикам");
		
		// Выдача денежных средств подотчетникам -----------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Выдача денежных средств подотчетникам");
		
		// Выдача зарплаты ---------------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Зарплата)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Выдача зарплаты");
		
		// Оплата налогов ----------------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Налоги)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Оплата налогов");
		
		// Возвраты покупателям ----------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Возвраты покупателям");
		
		// Прочие расходы ----------------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыРаспределенные)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Прочие расходы");		
		
		
		// ------------------------------------------------- ИТОГ ТД ---------------------------------------------
		
		ОбластьИтогРаздел.Параметры.СтрокаРаздел = "ТЕКУЩАЯ ДЕЯТЕЛЬНОСТЬ:";
		ОбластьИтогРаздел.Параметры.Итог = ИтогДС;
		ОбластьИтогРаздел.Параметры.ИтогП = ИтогП;
		ОбластьИтогРаздел.Параметры.ИтогР = ИтогР;
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Процент = ?(ВсегоТД = 0, 0, Окр(ОбластьИтогРаздел.Параметры.Итог/ВсегоТД * 100,2));
		Иначе
			ВсегоТД = ОбластьИтогРаздел.Параметры.Итог;	
		КонецЕсли;	
		
		ОбластьИтогРаздел.Параметры.Процент = ?(Процент = 0, "", Строка(Процент) +" %");
		
		ТабличныйДокумент.Вывести(ОбластьИтогРаздел);
		КонтрольнаяЦифра = КонтрольнаяЦифра + ИтогДС;
		ИтогДС = 0;
		ИтогП = 0;
		ИтогР = 0;	
		
		
		// ------------------------------------------------- ПРИХОД ФД -------------------------------------------
		ОбластьШапка.Параметры.Раздел = "ФИНАНСОВАЯ ДЕЯТЕЛЬНОСТЬ";
		ТабличныйДокумент.Вывести(ОбластьШапка);		
		ОбластьРаздел.Параметры.СтрокаРаздел = "Приход";
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		// Получение займа ---------------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Займы)", "Получение займа");
		
		// Взносы участников -------------------------------------------------------------------------------------
		ВывестиСтатьюДСПриход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Участники)", "Взносы участников");
		
		
		// ------------------------------------------------- РАСХОД ФД -------------------------------------------
		
		ОбластьРаздел.Параметры.СтрокаРаздел = "Расход";
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		// Возврат или выдача займа ------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Займы)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) ИЛИ СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Возврат или выдача займа");
		
		// Выплата дивидендов ------------------------------------------------------------------------------------
		ВывестиСтатьюДСРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Участники)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)", "Выплата дивидендов");
		
		
		// ------------------------------------------------- ИТОГ ФД ---------------------------------------------
		
		ОбластьИтогРаздел.Параметры.СтрокаРаздел = "ФИНАНСОВАЯ ДЕЯТЕЛЬНОСТЬ:";
		ОбластьИтогРаздел.Параметры.Итог = ИтогДС;
		ОбластьИтогРаздел.Параметры.ИтогП = ИтогП;
		ОбластьИтогРаздел.Параметры.ИтогР = ИтогР;	
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Процент = ?(ВсегоФД = 0, 0, Окр(ОбластьИтогРаздел.Параметры.Итог/ВсегоФД * 100,2));
		Иначе
			ВсегоФД = ОбластьИтогРаздел.Параметры.Итог;	
		КонецЕсли;	
		
		ОбластьИтогРаздел.Параметры.Процент = ?(Процент = 0, "", Строка(Процент) +" %");

		ТабличныйДокумент.Вывести(ОбластьИтогРаздел);
		КонтрольнаяЦифра = КонтрольнаяЦифра + ИтогДС;	
		ИтогДС = 0;
		ИтогП = 0;
		ИтогР = 0;
		
		// ------------------------------------------------- ПЕРЕМЕЩЕНИЕ -----------------------------------------
		
		ОбластьШапка.Параметры.Раздел = "ВНУТРЕННИЕ ПЕРЕМЕЩЕНИЯ";
		ТабличныйДокумент.Вывести(ОбластьШапка);	
		
		// Перемещения между кассами -----------------------------------------------------------------------------
		ВывестиСтатьюДСПриходРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)", "Перемещения между кассами");
				
		// Перемещения между счетами -----------------------------------------------------------------------------
		ВывестиСтатьюДСПриходРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Перемещения между счетами");
				
		//// Сдача наличных в банк ---------------------------------------------------------------------------------
		//ВывестиСтатьюДСПриходРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		//, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)", "Сдача наличных в банк");
		//		
		//// Получение наличных в банке ----------------------------------------------------------------------------
		//ВывестиСтатьюДСПриходРасход(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		//, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Получение наличных в банке");
		
		// Перемещение из кассы в банк ---------------------------------------------------------------------------------
		ВывестиСтатьюДСПриходРасходПП(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)", "Перемещение из кассы в банк");
				
		// Перемещение из банка в кассу ----------------------------------------------------------------------------
		ВывестиСтатьюДСПриходРасходПП(Макет, "СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)"
		, "СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк)", "Перемещение из банка в кассу");
		

		
		
		// ------------------------------------------------- ИТОГ ПЕРЕМЕЩЕНИЕ ------------------------------------
		
		ОбластьИтогРаздел.Параметры.СтрокаРаздел = "ДЕНЬГИ В ПУТИ:";
		ОбластьИтогРаздел.Параметры.Итог = ИтогП-ИтогР;
		ОбластьИтогРаздел.Параметры.ИтогП = ИтогП;
		ОбластьИтогРаздел.Параметры.ИтогР = ИтогР;
		ОбластьИтогРаздел.Параметры.Процент = "";
		ТабличныйДокумент.Вывести(ОбластьИтогРаздел);
		КонтрольнаяЦифра = КонтрольнаяЦифра + ИтогП-ИтогР;	

		
		// ------------------------------------------------- ИТОГИ ОБЩИЕ -----------------------------------------
		
		ОбластьОстаток.Параметры.СтрокаОстаток = "ОСТАТОК НА КОНЕЦ";
		ОбластьОстаток.Параметры.Остаток = КонтрольнаяЦифра;		
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Процент = ?(ВсегоКонОст = 0, 0, Окр(ОбластьОстаток.Параметры.Остаток/ВсегоКонОст * 100,2));
		Иначе
			ВсегоКонОст = ОбластьОстаток.Параметры.Остаток;	
		КонецЕсли;	
		
		ОбластьОстаток.Параметры.Процент = ?(Процент = 0, "", Строка(Процент) +" %");
		
		ТабличныйДокумент.Вывести(ОбластьОстаток);			
		
		
		ОбластьОстаток.Параметры.СтрокаОстаток = "КОНТРОЛЬНАЯ ЦИФРА";
		Если ЕстьОстатки Тогда
			ОбластьОстаток.Параметры.Остаток = РезультатОстатки.СуммаКонечныйОстатокДт;
		Иначе
			ОбластьОстаток.Параметры.Остаток = 0;	
		КонецЕсли;		
		ОбластьОстаток.Параметры.Процент = "";
		ТабличныйДокумент.Вывести(ОбластьОстаток);			
		
		Если Первый Тогда
			ВысотаОтчета = ТабличныйДокумент.ВысотаТаблицы + 1;
			ТабличныйДокументОтчет.Вывести(ТабличныйДокумент.ПолучитьОбласть(1,1,ВысотаОтчета,2));
			Первый = Ложь;
			ОбластьИтог = ТабличныйДокумент.ПолучитьОбласть(1,3,ВысотаОтчета,4);
		Иначе
			ТабличныйДокументОтчет.Присоединить(ТабличныйДокумент.ПолучитьОбласть(1,3,ВысотаОтчета,4));
		КонецЕсли;	
		
	КонецЦикла;
	
	ТабличныйДокументОтчет.Присоединить(ОбластьИтог);

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ТабличныйДокументОтчет.ФиксацияСверху = 5;
	ТабличныйДокументОтчет.ФиксацияСлева =  2;
	
	НачГр = 0;
	КонГр = 0;
	Для Каждого ГруппировкаСтрока Из СписокГруппировки Цикл
		
		Если ГруппировкаСтрока.Пометка Тогда
			НачГр = ГруппировкаСтрока.Значение;
		Иначе
			КонГр = ГруппировкаСтрока.Значение;
			Если НачГр <> КонГр  Тогда
				ТабличныйДокументОтчет.Область(НачГр+1,,КонГр,).Сгруппировать();
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	
	ТабличныйДокументОтчет.ПоказатьУровеньГруппировокСтрок(0);

КонецПроцедуры

&НаСервере
Процедура ВывестиСтатьюДСПриход(Макет, УсловиеДт, УсловиеКт, СтатьяДС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОборотыСтатьи.СубконтоДт2 КАК Статья,
	|	СУММА(ЕСТЬNULL(УправленческийОборотыДтКт.СуммаОборот, 0)) КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,
	|			) КАК УправленческийОборотыСтатьи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","") 
				  + ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")	
				  + ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"СубконтоДт1 В (&СчетКасса)","")+") КАК УправленческийОборотыДтКт
	|		ПО УправленческийОборотыСтатьи.СубконтоДт2 = УправленческийОборотыДтКт.СубконтоДт2
	|
	//|"+ ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0," ГДЕ УправленческийОборотыДтКт.СубконтоДт1 В (&СчетКасса) ","") +"  
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОборотыСтатьи.СубконтоДт2
	|УПОРЯДОЧИТЬ ПО
	|	Статья
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Статья";
	
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	КонецЕсли;		
	
	Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
	КонецЕсли;	
	
	Если ЭтаФорма.ПериодИспользование Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
		Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Запрос.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));		
		Иначе	
			Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
		КонецЕсли;	
		
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", '00010101');	
		Запрос.УстановитьПараметр("КонецПериода", '00010101');	
	КонецЕсли;
	
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтог.Следующий();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтрока.Параметры.Статья = СтатьяДС;
	ОбластьСтрока.Параметры.Приход = ВыборкаИтог.СуммаОборот;
	ТабличныйДокумент.Вывести(ОбластьСтрока);			
	
	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Истина);	
	КонецЕсли;

	
	ИтогДС = ИтогДС + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	ИтогП = ИтогП + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	
	ВыборкаСтатьи = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаСтатьи.Следующий() Цикл		

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьи.Статья;
		ОбластьСтрока.Параметры.Приход = ВыборкаСтатьи.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);			
		
	КонецЦикла;
	
	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Ложь);	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ВывестиСтатьюДСРасход(Макет, УсловиеДт, УсловиеКт, СтатьяДС)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОборотыСтатьи.СубконтоКт2 КАК Статья,
	|	СУММА(ЕСТЬNULL(УправленческийОборотыДтКт.СуммаОборот, 0)) КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,
	|			) КАК УправленческийОборотыСтатьи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","") 
				  + ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")	
				  + ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"СубконтоКт1 В (&СчетКасса)","")+") КАК УправленческийОборотыДтКт

	|		ПО УправленческийОборотыСтатьи.СубконтоКт2 = УправленческийОборотыДтКт.СубконтоКт2
	|
	//|"+ ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0," ГДЕ УправленческийОборотыДтКт.СубконтоКт1 В (&СчетКасса) ","") +"
	//|"+ ?(ЗначениеЗаполнено(СчетКасса)," ГДЕ УправленческийОборотыДтКт.СубконтоКт1 = &СчетКасса ","") +"  
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОборотыСтатьи.СубконтоКт2
	|УПОРЯДОЧИТЬ ПО
	|	Статья
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Статья";
		
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	КонецЕсли;	
	//Если ЗначениеЗаполнено(СчетКасса) Тогда
	//	Запрос.УстановитьПараметр("СчетКасса", СчетКасса);	
	//КонецЕсли;	
	
	Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
	КонецЕсли;	
	
	Если ЭтаФорма.ПериодИспользование Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
		Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Запрос.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));		
		Иначе	
			Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
		КонецЕсли;	
		
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", '00010101');	
		Запрос.УстановитьПараметр("КонецПериода", '00010101');	
	КонецЕсли;
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтог.Следующий();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтрока.Параметры.Статья = СтатьяДС;
	ОбластьСтрока.Параметры.Расход = ВыборкаИтог.СуммаОборот;
	ТабличныйДокумент.Вывести(ОбластьСтрока);			

	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Истина);	
	КонецЕсли;

	
	ИтогДС = ИтогДС - ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	ИтогР = ИтогР + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	
	ВыборкаСтатьи = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаСтатьи.Следующий() Цикл		

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьи.Статья;
		ОбластьСтрока.Параметры.Расход = ВыборкаСтатьи.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);			
		
	КонецЦикла;
	
	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Ложь);	
	КонецЕсли;
		
КонецПроцедуры	

&НаСервере
Процедура ВывестиСтатьюДСПриходРасход(Макет, УсловиеДт, УсловиеКт, СтатьяДС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОборотыСтатьи.СубконтоДт2 КАК Статья,
	|	СУММА(ЕСТЬNULL(УправленческийОборотыДтКт.СуммаОборот, 0)) КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,
	|			) КАК УправленческийОборотыСтатьи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|"+ УсловиеДт +",
	|,
	|"+ УсловиеКт +",
	|			,"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","")
				  + ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")	
				  + ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"СубконтоДт1 В (&СчетКасса)","")+") КАК УправленческийОборотыДтКт

	|		ПО УправленческийОборотыСтатьи.СубконтоДт2 = УправленческийОборотыДтКт.СубконтоДт2
	|
	//|"+ ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0," ГДЕ УправленческийОборотыДтКт.СубконтоДт1 В (&СчетКасса) ","") +"
	//|"+ ?(ЗначениеЗаполнено(СчетКасса)," ГДЕ УправленческийОборотыДтКт.СубконтоДт1 = &СчетКасса ","") +"  
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОборотыСтатьи.СубконтоДт2
	|УПОРЯДОЧИТЬ ПО
	|	Статья
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Статья";
		
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	КонецЕсли;	
	
	Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
	КонецЕсли;	
	
	Если ЭтаФорма.ПериодИспользование Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
		Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Запрос.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));		
		Иначе	
			Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
		КонецЕсли;	
		
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", '00010101');	
		Запрос.УстановитьПараметр("КонецПериода", '00010101');	
	КонецЕсли;

	
	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтог.Следующий();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтрока.Параметры.Статья = СтатьяДС;
	ОбластьСтрока.Параметры.Приход = ВыборкаИтог.СуммаОборот;
	ОбластьСтрока.Параметры.Расход = ВыборкаИтог.СуммаОборот;

	ТабличныйДокумент.Вывести(ОбластьСтрока);			

	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Истина);	
	КонецЕсли;

	
	ИтогДС = ИтогДС + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	ИтогП = ИтогП + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);
	ИтогР = ИтогР + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);	
	
	ВыборкаСтатьи = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаСтатьи.Следующий() Цикл		

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьи.Статья;
		ОбластьСтрока.Параметры.Приход = ВыборкаСтатьи.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);			
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьи.Статья;
		ОбластьСтрока.Параметры.Расход = ВыборкаСтатьи.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);	
		
	КонецЦикла;
	
	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Ложь);	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
// Через счет "переводы в пути"
Процедура ВывестиСтатьюДСПриходРасходПП(Макет, УсловиеДт, УсловиеКт, СтатьяДС)
	
	ЗапросРасход = Новый Запрос;
	ЗапросРасход.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОборотыСтатьи.СубконтоКт2 КАК Статья,
	|	СУММА(ЕСТЬNULL(УправленческийОборотыДтКт.СуммаОборот, 0)) КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПЕРЕВОДЫ),
	|,
	|"+ УсловиеКт +",
	|			,
	|			) КАК УправленческийОборотыСтатьи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПЕРЕВОДЫ),
	|,
	|"+ УсловиеКт +",
	|			,"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","")
				  + ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")	
				  + ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"СубконтоКт1 В (&СчетКасса)","")+") КАК УправленческийОборотыДтКт
	|		ПО УправленческийОборотыСтатьи.СубконтоКт2 = УправленческийОборотыДтКт.СубконтоКт2
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОборотыСтатьи.СубконтоКт2
	|УПОРЯДОЧИТЬ ПО
	|	Статья
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Статья";
		
	
	ЗапросПриход = Новый Запрос;
	ЗапросПриход.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОборотыСтатьи.СубконтоДт2 КАК Статья,
	|	СУММА(ЕСТЬNULL(УправленческийОборотыДтКт.СуммаОборот, 0)) КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|"+ УсловиеДт +",
	|,
	|СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПЕРЕВОДЫ),
	|			,
	|			) КАК УправленческийОборотыСтатьи
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.ОборотыДтКт(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|"+ УсловиеДт +",
	|,
	|СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПЕРЕВОДЫ),
	|			,"+ ?(ЗначениеЗаполнено(СтруктурнаяЕдиница),"СтруктурнаяЕдиница = &СтруктурнаяЕдиница","")
				  + ?(ЗначениеЗаполнено(СтруктурнаяЕдиница) И СчетКассаИспользование И СчетКассаОтбор.Количество() > 0, " И ", "")	
				  + ?(СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 ,"СубконтоДт1 В (&СчетКасса)","")+") КАК УправленческийОборотыДтКт
	|		ПО УправленческийОборотыСтатьи.СубконтоДт2 = УправленческийОборотыДтКт.СубконтоДт2
	|
	|СГРУППИРОВАТЬ ПО
	|	УправленческийОборотыСтатьи.СубконтоДт2
	|УПОРЯДОЧИТЬ ПО
	|	Статья
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	ОБЩИЕ,
	|	Статья";
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЗапросРасход.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
		ЗапросПриход.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	КонецЕсли;	
	
	Если СчетКассаИспользование И СчетКассаОтбор.Количество() > 0 Тогда
		ЗапросРасход.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
		ЗапросПриход.УстановитьПараметр("СчетКасса", СчетКассаОтбор);	
	КонецЕсли;	
	
	Если ЭтаФорма.ПериодИспользование Тогда
		
		ЗапросРасход.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
		ЗапросПриход.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
		Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			ЗапросРасход.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));		
			ЗапросПриход.УстановитьПараметр("КонецПериода", Дата(3999, 1, 1));
		Иначе	
			ЗапросРасход.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
			ЗапросПриход.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
		КонецЕсли;	
		
	Иначе
		ЗапросРасход.УстановитьПараметр("НачалоПериода", '00010101');	
		ЗапросРасход.УстановитьПараметр("КонецПериода", '00010101');	
		ЗапросПриход.УстановитьПараметр("НачалоПериода", '00010101');	
		ЗапросПриход.УстановитьПараметр("КонецПериода", '00010101');	
	КонецЕсли;

	
	ВыборкаИтогРасход = ЗапросРасход.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогРасход.Следующий();
	
	ВыборкаИтогПриход = ЗапросПриход.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогПриход.Следующий();

	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтрока.Параметры.Статья = СтатьяДС;
	ОбластьСтрока.Параметры.Приход = ВыборкаИтогПриход.СуммаОборот;
	ОбластьСтрока.Параметры.Расход = ВыборкаИтогРасход.СуммаОборот;

	ТабличныйДокумент.Вывести(ОбластьСтрока);			

	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Истина);	
	КонецЕсли;

	
	//ИтогДС = ИтогДС + ?(ЗначениеЗаполнено(ВыборкаИтог.СуммаОборот), ВыборкаИтог.СуммаОборот, 0);  //?
	ИтогП = ИтогП + ?(ЗначениеЗаполнено(ВыборкаИтогПриход.СуммаОборот), ВыборкаИтогПриход.СуммаОборот, 0);
	ИтогР = ИтогР + ?(ЗначениеЗаполнено(ВыборкаИтогРасход.СуммаОборот), ВыборкаИтогРасход.СуммаОборот, 0);	
	
	ВыборкаСтатьиРасход = ВыборкаИтогРасход.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаСтатьиРасход.Следующий() Цикл		

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьиРасход.Статья;
		ОбластьСтрока.Параметры.Расход = ВыборкаСтатьиРасход.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);			
				
	КонецЦикла;
	
	ВыборкаСтатьиПриход = ВыборкаИтогПриход.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаСтатьиПриход.Следующий() Цикл		

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		ОбластьСтрока.Параметры.Статья = ВыборкаСтатьиПриход.Статья;
		ОбластьСтрока.Параметры.Приход = ВыборкаСтатьиПриход.СуммаОборот;
		ТабличныйДокумент.Вывести(ОбластьСтрока);			
				
	КонецЦикла;
	
	Если Первый Тогда
		СписокГруппировки.Добавить(ТабличныйДокумент.ВысотаТаблицы,,Ложь);	
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////  ВСПОМОГАТЕЛЬНЫЕ ///////////////////////////////////////

&НаКлиенте
Процедура ВычислитьСумму(Команда)
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(ТабличныйДокументОтчет, ВыделенныеОбласти());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВычислитьСуммуСервер(Знач ОтчетТабличныйДокумент, Знач ВыделенныеОбласти)
	Сумма = РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, ВыделенныеОбласти);
	Возврат Формат(Сумма, "ЧН=0");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСуммуВыделенныхЯчеек(ТабличныйДокумент, ВыделенныеОбласти)
	
	#Если Клиент Тогда
		ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
	#КонецЕсли
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат 0;
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат Неопределено; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = 0;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат Неопределено; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Сумма = Сумма + Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Сумма = Сумма + СтрокаВЧисло(Ячейка.Текст);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Функция ВыделенныеОбласти()
	Результат = Новый Массив;
	Для Каждого ВыделеннаяОбласть Из ТабличныйДокументОтчет.ВыделенныеОбласти Цикл
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		Структура = Новый Структура("Верх, Низ, Лево, Право, ТипОбласти");
		ЗаполнитьЗначенияСвойств(Структура, ВыделеннаяОбласть);
		Результат.Добавить(Структура);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаВЧисло(ИсходнаяСтрока)
	// Превращает строку в число без вызова исключений. Стандартная функция преобразования
	//   Число() строго контролирует отсутствие каких-либо символов кроме числовых.
	
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Тогда // Минус
			Если Результат <> 0 Тогда
				Возврат 0;
			КонецЕсли;
			ЗнакОтрицательный = Истина;
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СкрытьПоказатьБыстрыеНастройки(Команда)
	
	Элементы.ГруппаНастройки.Видимость = НЕ Элементы.ГруппаНастройки.Видимость;
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(ТабличныйДокументОтчет, ВыделенныеОбласти());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

///////////////////////////// ПЕРИОД /////////////////////////////////////////////////////

&НаКлиенте
Процедура ПериодВидПриИзменении(Элемент)
	
	Значение = ЭтаФорма.Период;	
	ВидПериода = ЭтаФорма.ПериодВид;
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
		
		Элементы.ГруппаПериодСтраницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйПериод;
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		
	Иначе
		
		Элементы.ГруппаПериодСтраницы.ТекущаяСтраница = Элементы.СтраницаСтандартныйПериод;
		
		// Приведение значения периода в соответствие с выбранным видом.
		НачалоПериода = НачалоДня(Значение.ДатаНачала);
		Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
			НачалоПериода = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
		КонецЕсли;
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(ВидПериода, НачалоПериода);
		КонецПериода  = ФункцииОтчетовКлиентСервер.КонецПериодаОтчета(ВидПериода, НачалоПериода);
		
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
		
	КонецЕсли;
	
	Представление = ФункцииОтчетовКлиентСервер.ПредставлениеСтандартногоПериода(Значение, ВидПериода);
	ЭтаФорма.ПериодПредставление = Представление;
	ЭтаФорма.Период     = Значение;	
	
	ЭтаФорма.ПериодИспользование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Значение = ЭтаФорма.Период;	
	ВидПериода = ЭтаФорма.ПериодВид;

	
	НачалоПериода = Значение.ДатаНачала;
	Если НачалоПериода = '00010101' тогда
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(ВидПериода, ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	// Выбор периода из выпадающего списка.
	ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, Значение.Вариант, Неопределено);
		
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	Если Период.ДатаОкончания < Период.ДатаНачала Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно задан период!");
		ЭтаФорма.ПериодИспользование = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	Если Период.ДатаОкончания < Период.ДатаНачала Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно задан период!");
		ЭтаФорма.ПериодИспользование = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Запись результата выбора...
	НачалоПериода = ВыбранноеЗначение.НачалоПериода;
	КонецПериода  = ВыбранноеЗначение.КонецПериода;
	Если НачалоПериода <> '00010101' Тогда
		НачалоПериода = НачалоДня(НачалоПериода);
	КонецЕсли;
	Если КонецПериода <> '00010101' Тогда
		КонецПериода = КонецДня(КонецПериода);
	КонецЕсли;
	
	Значение = ЭтаФорма.Период;
	Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Значение.ДатаНачала    = НачалоПериода;
	Значение.ДатаОкончания = КонецПериода;

	ЭтаФорма.Период = Значение;
	ЭтаФорма.ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
	ЭтаФорма.ПериодИспользование = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, Вариант, Знач ИндексНачальногоЗначения)
	
	Если Вариант = Неопределено Или Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		СписокПериодов = ФункцииОтчетовКлиентСервер.СписокФиксированныхПериодов(НачалоПериода, ВидПериода);
		СписокПериодов.Добавить("ВыборАвтоматическиВычисляемогоПериода", НСтр("ru = 'Относительный...'"));
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(НачалоПериода);
		КонецЕсли;
	Иначе
		СписокПериодов = ФункцииОтчетовКлиентСервер.СписокВычисляемыхПериодов(ВидПериода);
		СписокПериодов.Добавить("ВыборФиксированногоПериода", НСтр("ru = 'Фиксированный...'"));
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(Вариант);
		КонецЕсли;
	КонецЕсли;
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыбратьПериодИзВыпадающегоСпискаЗавершение",ЭтотОбъект,
	Новый Структура("НачалоПериода,СписокПериодов,Элемент,Вариант",НачалоПериода,СписокПериодов,Элемент,Вариант)), 
	СписокПериодов, Элемент, ИндексНачальногоЗначения);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодИзВыпадающегоСпискаЗавершение(РезультатВыбора,ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидПериода = ЭтаФорма.ПериодВид;
	НачалоПериода  = ДополнительныеПараметры.НачалоПериода;
	СписокПериодов = ДополнительныеПараметры.СписокПериодов;
	Элемент        = ДополнительныеПараметры.Элемент;
	Вариант        = ДополнительныеПараметры.Вариант;  
	
	Если РезультатВыбора.Значение = "ВыборАвтоматическиВычисляемогоПериода" Тогда
		ВариантКопия = ВариантСтандартногоПериодаПоВиду(ВидПериода);
		ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, ВариантКопия, Неопределено);
		Возврат;
	ИначеЕсли РезультатВыбора.Значение = "ВыборФиксированногоПериода" Тогда
		ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, НачалоПериода, Неопределено, Неопределено);
		Возврат;
	ИначеЕсли ТипЗнч(РезультатВыбора.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ЭтаФорма.ПериодПредставление = ?(ПустаяСтрока(РезультатВыбора.Представление), Строка(РезультатВыбора.Значение), РезультатВыбора.Представление);
		ЭтаФорма.Период.Вариант = РезультатВыбора.Значение;
	Иначе
		
		// Листание вверх-вниз.
		Индекс = СписокПериодов.Индекс(РезультатВыбора);
		Если Индекс = 0 Или Индекс = СписокПериодов.Количество() - 2 Тогда
			ВыбратьПериодИзВыпадающегоСписка(Элемент, ВидПериода, РезультатВыбора.Значение, Вариант, Индекс);
			Возврат; 
		КонецЕсли;	
		
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(ВидПериода, РезультатВыбора.Значение);
		КонецПериода  = ФункцииОтчетовКлиентСервер.КонецПериодаОтчета(ВидПериода, РезультатВыбора.Значение);
		
		ЭтаФорма.ПериодПредставление = РезультатВыбора.Представление;
		
		ЭтаФорма.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ЭтаФорма.Период.ДатаНачала    = НачалоПериода;
		ЭтаФорма.Период.ДатаОкончания = КонецПериода;
		
	КонецЕсли;
		
	ЭтаФорма.ПериодИспользование = Истина;

КонецПроцедуры


&НаКлиенте
Функция ВариантСтандартногоПериодаПоВиду(ВидПериода)
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Декада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Полугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СтруктурныеЕдиницыОтборПриИзменении(Элемент)
	
	Если ЭтаФорма.СтруктурныеЕдиницыОтбор.Количество() > 0 Тогда
		ЭтаФорма.СтруктурныеЕдиницыИспользование = Истина;
	Иначе
		ЭтаФорма.СтруктурныеЕдиницыИспользование = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура БанкКассаОтборПриИзменении(Элемент)
	
	Если ЭтаФорма.СчетКассаОтбор.Количество() > 0 Тогда
		ЭтаФорма.СчетКассаИспользование = Истина;
	Иначе
		ЭтаФорма.СчетКассаИспользование = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

 #КонецОбласти
